blog/2013-07-06-linkfest06072013.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 6.7.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning Hyndsight - Facts and fallacies of the AIC Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	
</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		<a class="facebook" href="http://www.facebook.com/ronert.obst" title="Facebook">Facebook</a>
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 6.7.2013</h2>
	<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://robjhyndman.com/hyndsight/aic/">Hyndsight - Facts and fallacies of the AIC</a>
</li>
<li><a href="http://www.tandfonline.com/doi/abs/10.1080/10618600.2013.819178#.UdfoyWQ-J7l">Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection</a>
</li>
<li><a href="http://www.wired.com/wiredenterprise/2013/06/yoshua-bengio/">Researcher Dreams Up Machines That Learn Without Humans</a>
</li>
<li><a href="http://techtalks.tv/talks/drednets/58115/">Drednets</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://journal.r-project.org/archive/2013-1/kahle-wickham.pdf">ggmap</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://jmlr.org/papers/volume14/curtin13a/curtin13a.pdf">MLPACK: A Scalable C++ Machine Learning Library</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://fastml.com/processing-large-files-line-by-line/">Processing large files, line by line - FastML</a>
</li>
<li><a href="http://www.youtube.com/user/EnthoughtMedia/videos?hl=en&client=mv-google&gl=DE&nomobile=1">SciPy 2013 Videos</a>
</li>
<li><a href="http://manishamde.github.io/blog/2013/03/07/pandas-and-python-top-10/">Pandas and Python: Top 10 - Curiosity</a>
</li>
<li><a href="http://blog.yhathq.com/posts/sql-for-data-scientists.html">7 handy SQL features for data scientists</a>
</li>
<li><a href="http://bigdatauniversity.com/courses/">Big Data University</a>
</li>
<li><a href="http://radfordneal.wordpress.com/2013/07/02/fixing-rs-named-problems-in-pqr/">Fixing R’s NAMED problems in pqR | Radford Neal&#8217;s blog</a>
</li>
<li><a href="http://idiap.github.io/bob/">Bob - A framework for signal processing and machine learning</a>
</li>
<li><a href="http://www.wilfred.me.uk/blog/2013/06/29/multi-paradigm-adventures/">Adventures in Multi Paradigm Programming</a>
</li>
<li><a href="http://journal.r-project.org/archive/2013-1/">Volume 5/1, June 2013. The R Journal</a>
</li>
<li><a href="http://www.thehackernotes.com/robbyrussell/oh-my-zsh">Hacker Notes for Oh-my-zsh</a>
</li>
<li><a href="http://damontallen.github.io/IPython-quick-ref-sheets/">Ipython-quick-ref-sheets</a>
</li>
<li><a href="http://compgeom.cs.uiuc.edu/~jeffe/teaching/algorithms/">Jeff Erickson&#8217;s Algorithms Course Materials</a>
</li>
<li><a href="http://projects.haskell.org/pipermail/haskellmode-emacs/2013-June/000188.html">ANNOUNCE: haskell-mode 13.07</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-07-06T00:00:00+02:00" pubdate data-updated="true">Jul 6<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	<a class="addthis_button_facebook_like" fb:like:layout="button_count"></a>
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>